// SPDX-License-Identifier: GPL-2.0
/*
 * Copyright (C) 2022 Samsung Electronics Co., Ltd.
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 as
 * published by the Free Software Foundation.
 */
#include "stm_dev.h"
#include "stm_reg.h"

#if IS_ENABLED(CONFIG_SPU_VERIFY)
#define SUPPORT_FW_SIGNED
#endif

#ifdef SUPPORT_FW_SIGNED
#include <linux/spu-verify.h>
#endif

#define SIGNEDKEY_SIZE (256)
#define FLASH_MAX_SECTIONS		10

#define FLASH_PAGE_SIZE			(4 * 1024)	/* page size of 4KB */
#define BIN_HEADER_SIZE			(32 + 4)	/* fw ubin main header size including crc */
#define SECTION_HEADER_SIZE		20		/* fw ubin section header size */
#define BIN_HEADER			0xBABEFACE	/* fw ubin main header identifier constant */
#define SECTION_HEADER			0xB16B00B5	/* fw ubin section header identifier constant */
#define CHIP_ID				0x3652		/* chip id of finger tip device, spruce */
#define NUM_FLASH_PAGES			48		/* number of flash pages in fingertip device, spruce */

#define STM_TS_FILE_SIGNATURE		BIN_HEADER

#define WRITE_CHUNK_SIZE 1024
#define DRAM_SIZE (64 * 1024)	// 64KB

enum {
	TSP_BUILT_IN = 0,
	TSP_SDCARD,
	TSP_SIGNED_SDCARD,
	TSP_SPU,
	TSP_VERIFICATION,
};


struct stm_ts_header {		// Total 36 bytes
	u32	fw_crc;				// 0
	u32	header_signature;	// 4
	u8 format_id;			// 8
	u8 chip_id[3];			// 9
	u32 ext_release_ver1;	// 12
	u32 ext_release_ver;	// 16
	u16 fw_ver;				// 20
	u16 cfg_ver;			// 22
	u8 project_id;			// 24
	u8 ic_name;				// 25
	u8 module_ver;			// 26
	u8 reserved[9];			// 27
} __packed;

/**
 * @brief  Type definitions - header structure of firmware file (.ubin)
 */

/**
 * Struct which contains  the header and data of a flash section
 */
struct fw_section {
	u16 sec_id;		/* FW section ID mapped for each flash sections */
	u16 sec_ver;		/* FW section version  */
	u32 sec_size;		/* FW sectionsize in bytes  */
	u8 *sec_data;		/* FW section data */
};

/**
 * Struct which contains information and data of the FW file to be burnt
 *into the IC
 */
struct firmware_file {
	u16 fw_ver;					/*  FW version of the FW file */
	u8 flash_code_pages;				/* size of fw code in pages*/
	u8 panel_info_pages;				/* size of fw sections in pages*/
	u32 fw_code_size;				/*  size of fw code in bytes*/
	u8 *fw_code_data;				/* fw code data*/
	u8 num_code_pages;				/* size depending on the FW code size*/
	u8 num_sections;								/* fw sections in fw file */
	struct fw_section sections[FLASH_MAX_SECTIONS];	/*  fw section data for each section*/
};

/**
